greeting_message = '''*Добро пожаловать на лучшее мероприятие этого лета!*
Скорей вводи выданный вашей команде токен и зарегистрируйся: 
'''

succesfull_registration = '''Вам досталась возможность сливать баллы команде *{}*\n
У вас есть несколько способов сделать это:

*Рулетка:*
Фиксированная ставка в 10 баллов, вам может выпасть как больше, так и меньше. 
        
*Ставка на задачу:*
Вы ставите выбранное количество баллов на одну из задач, по которой еще не было попыток. Если вы её сдаете с первого раза, вы получаете свои баллы x2. 

*Игра в три наперстка:*
Мы загадываем кладем подарок под одну из кнопок. Если вы угадываете, под какую, вы его получаете. Попытка так же стоит 10 баллов. 
'''

unsuccessfull_registration = 'Неверный код команды. Попробуй еще или попроси помощи более трезвого товарища'

unknown_command = 'Ты немного заплутал, возможно ты искал:'

help_command = '''Небольшое напоминание, что вы можете сделать со своими честно(или не очень) заработанными баллами:\n
*Рулетка:*
Фиксированная ставка в 10 баллов, вам может выпасть как больше, так и меньше. 
            
*Ставка на задачу:*
Вы ставите выбранное количество баллов на одну из задач, по которой еще не было попыток. Если вы её сдаете с первого раза, вы получаете свои баллы x2. 

*Игра в три наперстка:*
Мы загадываем кладем подарок под одну из кнопок. Если вы угадываете, под какую, вы его получаете. Попытка так же стоит 10 баллов. 
'''

monkey_gif = 'https://media.giphy.com/media/OXMQTO6pc4zG4wmlcT/giphy.gif'
kitten_gif = 'https://media.giphy.com/media/4ddqzeDazuc8nLBwXm/giphy.gif'
lost_gif = 'https://media.giphy.com/media/M0yz5KH4Gu8cSxzHHA/giphy.gif'

menu_text = 'Чем займёмся сейчас, мой маленький лудоман?'

all_tasks_tried = 'По всем задачам уже есть попытки. Попытайте счастье в другом месте!'
set_task_bet = 'Сколько баллов хочешь поставить на задачу {}?'
task_bet_int_error = 'Ставка должна быть целым числом'
task_bet_success = 'Вы поставили {} баллов на решение {} с первого раза, да поможет вам Бог Яндекс Контеста'
task_bet_not_enough_money = 'У вас не хватает баллов на ставку, не расстраивайтесь, вы сможете проиграть и эти остатки)'

casino_result = 'Вам выпало: ||{}||'

shell_start = 'Где лут?'

shell_win = '''{}

Ты выиграл {}, желаю поскорее тебе их проиграть)'''

shell_loss = '''{}


Программируешь, ты, конечно, лучше... Иди займись чем-нибудь полезным и возвращайся с новыми баллами.
'''
